{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"archives","text":"","link":"/archives/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"About Us","text":"Company ProfileHighGo is a database software products and services provider leading in the country. HighGo was established in 2005, and headquarters is located in Jinan, has branches and offices in Province Beijing, Xi’an, Qingdao and other places.HighGo signed an agreement with Regus in 2016.The address of HighGo in America is: 2018 156th Avenue,N.E. Suite 100 Bellevue,WA 98007 HighGo is the outstanding software enterprises, high-tech enterprises, has passed ISO9001 Quality Management SystemCertification, ISO20000IT Service Management System Certification, ISO27001 Information Security Management System Certification and CMMI3 level evaluation and certification. HighGo Software already has more than ten patents and copyright in the data management field, covering data management, user training, technical support services and other areas, HighGo establishes data lifecycle management system, and its comprehensive data solution has a good reputation in the industry. HighGo 10 YearHighGo with nearly a decade of experience in database integrated services in the country cultivates the thousands of users. HighGo database platform solutions save a lot of cost for users, by providing users with specialized data services to overall improve the level of database use in IT department. Enterprise CultureHighGo upholds entrepreneurial spirits of unity, hard work, courage, innovation, in order to revitalize the national infrastructure software for the vision , make domestic database brand bigger and stronger, ambitious, front with our customers and partners to stride along the line, create a greate cause! Connect UsOffice Address: Highgo Software Inc., 10326 Whalley Blvd #3,Surrey,BC","link":"/about/index.html"}],"posts":[{"title":"how to layout my blogs","text":"","link":"/2019/05/14/how-to-layout-my-blogs/"},{"title":"Hexo Github","text":"What is Hexo?Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Step1.create new Repository in Github2.Install Tools3.Deploy Website4.Use Hexo5.Auto browersersync6.Markdown Article Create new Repository in GithubOnce you’ve signed in,you’ll create a new repository to get started.On the new repository screeen, you need to give this repository a special name to generate your website.Your website’s files will live in a repository named username.github.io （where ‘username’ is your actual GitHub user name）.click create repository. Install Tools Gitdownload git. Test ‘git’ in command line weather installed succeed.connect git to github account.click right to open Git Bash set user.name and user.email git config --global user.name git config --global user.email ssh security file: ssh-keygen -t rsa -C enter three times and don’t need to set up security password.find id_rsa.pub in .ssh files, and copy content in id_rsa.pub setting github ssh security key Test github security key whether set up succeed in GitBashcommand line: ssh git@github.comYou don’t need to enter your username and password when you git push a repository. Install Tools Node.jsdownload Node.js.Test node.jscommand line: node -VTest npmcommand line: npm -VHexo environment has been completed!!! Install HexoCreate a new file, and you can named ‘Blog’. command in the Blog file. Install Hexo D:\\Blog&gt; npm install -g hexo-cli init blog page D:\\Blog&gt;hexo init blog Test our blog whether create succeed, command three lines deparatelynew a blog article D:\\Blog&gt;hexo new myblog generate files D:\\Blog&gt;hexo g start local server D:\\Blog&gt;hexo s ctrl + click url, and we can see our blog. Deploy Websiteconfig the _config.yml in the root blog. connect Hexo to Github, This configuration can let Hexo to know where should deploy the project Install git deploy plugin npm install hexo-deployer-git --save Then we test it, we command three lines.clean publish D:\\Blog&gt;hexo clean generate files D:\\Blog&gt;hexo g deploy to github D:\\Blog&gt;hexo d Open browser to put in username.github.io. You can find the website in github pages setting.Your blog is online. Resource: you can git push another branch ‘hexo’deploy: you git deploy on branch ‘master’Using HexoDirectory structure ---_config.yml globale configuration ---package.json parameter and dependencies ---scaffolds stucture file ---source new blogs --_posts you can see new blogs .md files in this file ---themes you can download themes and put it under this files Auto browersersyncnpm install -g browser-sync check install succeed browser-sync --version install plugin browsersync npm install hexo-browsersync --save After you edit file, you enter ctrl+s, browser will refreh the page. Themes (ejs &amp; stylus)ejs is Embedded JavaScript templating.What is the “E” for? “Embedded?” Could be. How about “Effective,” “Elegant,” or just “Easy”? EJS is a simple templating language that lets you generate HTML markup with plain JavaScript. No religiousness about how to organize things. No reinvention of iteration and control-flow. It’s just plain JavaScript.stylus XPRESSIVE, DYNAMIC, ROBUST CSS.Themes directory structure ---languages languages files international ---layout pages layout files .ejs files ---scripts Hexo scripts ---source resource files including stylus files ---_config.yml themes configuration file Markdown Articledownload tool Markdown to edit md file.","link":"/2019/05/14/hexo-github/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"hexo github","slug":"hexo-github","link":"/tags/hexo-github/"}],"categories":[{"name":"blogs","slug":"blogs","link":"/categories/blogs/"},{"name":"hexo","slug":"hexo","link":"/categories/hexo/"}]}